
icc2_shell> open_lib
Error: Required argument 'library_name' was not found (CMD-007)
icc2_shell> open_lib lib
Information: Loading library file '/home/userdata/21mvd0086/Simple_Processor_Working/Physical_Synthesis_ICC2_Version2/lib' (FILE-007)
Information: Loading library file '/home/userdata/21mvd0086/Simple_Processor_Working/Physical_Synthesis_ICC2_Version2/CLIBs/saed14rvt_tt0p8v125c.ndm' (FILE-007)
Information: Loading library file '/home/userdata/21mvd0086/Simple_Processor_Working/Physical_Synthesis_ICC2_Version2/CLIBs/saed14hvt_tt0p8v125c.ndm' (FILE-007)
Information: Loading library file '/home/userdata/21mvd0086/Simple_Processor_Working/Physical_Synthesis_ICC2_Version2/CLIBs/saed14lvt_tt0p8v125c.ndm' (FILE-007)
Information: Loading library file '/home/userdata/21mvd0086/Simple_Processor_Working/Physical_Synthesis_ICC2_Version2/CLIBs/saed14rvt_tt0p8v125c_physical_only.ndm' (FILE-007)
Information: Loading library file '/home/userdata/21mvd0086/Simple_Processor_Working/Physical_Synthesis_ICC2_Version2/CLIBs/saed14hvt_tt0p8v125c_physical_only.ndm' (FILE-007)
Information: Loading library file '/home/userdata/21mvd0086/Simple_Processor_Working/Physical_Synthesis_ICC2_Version2/CLIBs/saed14lvt_tt0p8v125c_physical_only.ndm' (FILE-007)
Information: Loading library file '/home/userdata/21mvd0086/Simple_Processor_Working/Physical_Synthesis_ICC2_Version2/CLIBs/EXPLORE_physical_only.ndm' (FILE-007)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14rvt_tt0p8v125c', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library "lib'. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14hvt_tt0p8v125c', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library "lib'. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14lvt_tt0p8v125c', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library "lib'. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14rvt_tt0p8v125c_physical_only', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library "lib'. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14hvt_tt0p8v125c_physical_only', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library "lib'. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'saed14lvt_tt0p8v125c_physical_only', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library "lib'. (NDM-102)
Warning: Technology used to create frame-view and current technology have inconsistency: Min spacings are different for layer 'M1'. (FRAM-054)
Warning: Technology 'saed14rvt_1p9m.tf' used for frame-view creation in library 'EXPLORE_physical_only', is inconsistent with the current technology 'saed14nm_1p9m_mw.tf' of library "lib'. (NDM-102)
Information: Auto created reference libraries are up-to-date, no need to rebuild. (LIB-084)
{lib}
icc2_shell> list_blocks
Lib lib /home/userdata/21mvd0086/Simple_Processor_Working/Physical_Synthesis_ICC2_Version2/lib tech current
  ->  0 simple_processor_Top.design May-22-15:53
  ->  0 import_done.design May-22-15:53
  ->  0 Simple_Processor_Floorplan_done.design May-22-16:12
  ->  0 Simple_Processor_Powerplan_done.design May-22-16:19
  ->  0 Placement_done_22nd_may.design May-22-17:31
  ->  0 CTS_Done_22nd_May.design May-22-17:32
  ->  0 Simple_Processor_27th_May_Done.design May-27-18:40
  ->  0 Simple_Processor_Placement_27th_May_done.design May-27-18:42
  ->  0 29th_MAY_FLOORPLAN.design May-29-20:04
9
icc2_shell> open_blocks 29th_MAY_FLOORPLAN
Error: unknown command 'open_blocks' (CMD-005)
icc2_shell> open_block 29th_MAY_FLOORPLAN
Information: User units loaded from library 'saed14rvt_tt0p8v125c' (LNK-040)
Opening block 'lib:29th_MAY_FLOORPLAN.design' in edit mode
{lib:29th_MAY_FLOORPLAN.design}
icc2_shell> link block
Warning: Nothing implicitly matched 'block' (SEL-003)
Error: Nothing matched for block (SEL-005)
icc2_shell> link_block
Using libraries: lib saed14rvt_tt0p8v125c saed14hvt_tt0p8v125c saed14lvt_tt0p8v125c saed14rvt_tt0p8v125c_physical_only saed14hvt_tt0p8v125c_physical_only saed14lvt_tt0p8v125c_physical_only EXPLORE_physical_only
Visiting block lib:29th_MAY_FLOORPLAN.design
  skip name data 44... end_option 
Design 'simple_processor_Top' was successfully linked.
1
icc2_shell> start_gui
Load ICV ICCII menu file: /home/synopsys/installs/icvalidator/P-2019.06-3/etc/tcl-u/Icc2Menu.tcl
 + VUE INFO: Please click View->IC Validator VUE in LayoutWindow menu
            to launch VUE.

 + VUE INFO: Found a usable port: 2446

Begin building search trees for block lib:29th_MAY_FLOORPLAN.design
Done building search trees for block lib:29th_MAY_FLOORPLAN.design (time 0s)
icc2_shell> sh gedit &
48277
icc2_shell> create_net -power VDD
{VDD}
icc2_shell> create_net -ground VSS
{VSS}
icc2_shell> connect_pg_net -net VDD [get_pins -hierarchical "*/VDD"]
icc2_shell> connect_pg_net -net VSS [get_pins -hierarchical "*/VSS"]
icc2_shell> set_attribute [get_lib_cells */*TIE*] dont_touch false
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE0_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE0_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE1_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE1_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIEDIN_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIEDIN_V1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE1_V1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE0_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE1_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIEDIN_PV1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE0_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE0_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE1_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE1_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIEDIN_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIEDIN_V1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE1_V1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE0_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE1_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIEDIN_PV1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE0_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE0_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE1_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE1_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIEDIN_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIEDIN_V1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE1_V1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE0_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE1_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIEDIN_PV1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIE0_4.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIE0_PV1ECO_1.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIE0_V1_2.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIE1_4.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIE1_PV1ECO_1.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIE1_V1ECO_1.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIE1_V1_2.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIEDIN_4.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIEDIN_PV1ECO_6.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'EXPLORE_physical_only:SAEDSLVT14_TIEDIN_V1ECO_6.frame' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
{saed14rvt_tt0p8v125c/SAEDRVT14_TIE0_4 saed14rvt_tt0p8v125c/SAEDRVT14_TIE0_V1_2 saed14rvt_tt0p8v125c/SAEDRVT14_TIE1_4 saed14rvt_tt0p8v125c/SAEDRVT14_TIE1_V1_2 saed14rvt_tt0p8v125c/SAEDRVT14_TIEDIN_4 saed14rvt_tt0p8v125c/SAEDRVT14_TIEDIN_V1ECO_6 saed14rvt_tt0p8v125c/SAEDRVT14_TIE1_V1ECO_1 saed14rvt_tt0p8v125c/SAEDRVT14_TIE0_PV1ECO_1 saed14rvt_tt0p8v125c/SAEDRVT14_TIE1_PV1ECO_1 saed14rvt_tt0p8v125c/SAEDRVT14_TIEDIN_PV1ECO_6 saed14hvt_tt0p8v125c/SAEDHVT14_TIE0_4 saed14hvt_tt0p8v125c/SAEDHVT14_TIE0_V1_2 saed14hvt_tt0p8v125c/SAEDHVT14_TIE1_4 saed14hvt_tt0p8v125c/SAEDHVT14_TIE1_V1_2 saed14hvt_tt0p8v125c/SAEDHVT14_TIEDIN_4 saed14hvt_tt0p8v125c/SAEDHVT14_TIEDIN_V1ECO_6 saed14hvt_tt0p8v125c/SAEDHVT14_TIE1_V1ECO_1 saed14hvt_tt0p8v125c/SAEDHVT14_TIE0_PV1ECO_1 saed14hvt_tt0p8v125c/SAEDHVT14_TIE1_PV1ECO_1 saed14hvt_tt0p8v125c/SAEDHVT14_TIEDIN_PV1ECO_6 saed14lvt_tt0p8v125c/SAEDLVT14_TIE0_4 saed14lvt_tt0p8v125c/SAEDLVT14_TIE0_V1_2 saed14lvt_tt0p8v125c/SAEDLVT14_TIE1_4 saed14lvt_tt0p8v125c/SAEDLVT14_TIE1_V1_2 saed14lvt_tt0p8v125c/SAEDLVT14_TIEDIN_4 saed14lvt_tt0p8v125c/SAEDLVT14_TIEDIN_V1ECO_6 saed14lvt_tt0p8v125c/SAEDLVT14_TIE1_V1ECO_1 saed14lvt_tt0p8v125c/SAEDLVT14_TIE0_PV1ECO_1 saed14lvt_tt0p8v125c/SAEDLVT14_TIE1_PV1ECO_1 saed14lvt_tt0p8v125c/SAEDLVT14_TIEDIN_PV1ECO_6 EXPLORE_physical_only/SAEDSLVT14_TIE0_4/frame EXPLORE_physical_only/SAEDSLVT14_TIE0_PV1ECO_1/frame EXPLORE_physical_only/SAEDSLVT14_TIE0_V1_2/frame EXPLORE_physical_only/SAEDSLVT14_TIE1_4/frame EXPLORE_physical_only/SAEDSLVT14_TIE1_PV1ECO_1/frame EXPLORE_physical_only/SAEDSLVT14_TIE1_V1ECO_1/frame EXPLORE_physical_only/SAEDSLVT14_TIE1_V1_2/frame EXPLORE_physical_only/SAEDSLVT14_TIEDIN_4/frame EXPLORE_physical_only/SAEDSLVT14_TIEDIN_PV1ECO_6/frame EXPLORE_physical_only/SAEDSLVT14_TIEDIN_V1ECO_6/frame}
icc2_shell> set_lib_cell_purpose -include optimization [get_lib_cells */*TIE*]
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE0_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE0_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE1_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE1_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIEDIN_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIEDIN_V1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE1_V1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE0_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIE1_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14rvt_tt0p8v125c:SAEDRVT14_TIEDIN_PV1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE0_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE0_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE1_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE1_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIEDIN_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIEDIN_V1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE1_V1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE0_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIE1_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14hvt_tt0p8v125c:SAEDHVT14_TIEDIN_PV1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE0_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE0_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE1_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE1_V1_2.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIEDIN_4.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIEDIN_V1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE1_V1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE0_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIE1_PV1ECO_1.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed14lvt_tt0p8v125c:SAEDLVT14_TIEDIN_PV1ECO_6.timing' is set in the current block '29th_MAY_FLOORPLAN', because the actual library setting may not be overwritten. (ATTR-12)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIE0_4.frame' which has no logical model. (NDMUI-010)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIE0_PV1ECO_1.frame' which has no logical model. (NDMUI-010)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIE0_V1_2.frame' which has no logical model. (NDMUI-010)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIE1_4.frame' which has no logical model. (NDMUI-010)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIE1_PV1ECO_1.frame' which has no logical model. (NDMUI-010)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIE1_V1ECO_1.frame' which has no logical model. (NDMUI-010)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIE1_V1_2.frame' which has no logical model. (NDMUI-010)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIEDIN_4.frame' which has no logical model. (NDMUI-010)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIEDIN_PV1ECO_6.frame' which has no logical model. (NDMUI-010)
Warning: The 'set_lib_cell_purpose' command cannot be used on library cell 'EXPLORE_physical_only:SAEDSLVT14_TIEDIN_V1ECO_6.frame' which has no logical model. (NDMUI-010)
1
icc2_shell> create_pg_mesh_pattern P_top_two -layers { { {horizontal_layer: M9} {width: 0.12} {spacing: interleaving} {pitch: 4.8} {offset: 1.6} {trim : true} } { {vertical_layer: M8}   {width: 0.12} {spacing: interleaving} {pitch: 4.8} {offset: 1.6}  {trim : true} } }
Successfully create mesh pattern P_top_two.
1
icc2_shell> set_pg_strategy S_default_vddvss -core -pattern   { {name: P_top_two} {nets:{VSS VDD}} } -extension { {{stop:design_boundary_and_generate_pin}} }
Successfully set PG strategy S_default_vddvss.
icc2_shell> compile_pg -strategies {S_default_vddvss}
Sanity check for inputs.
No strategy-level via rule is specified, the default rule will be applied.
Automatic PG net connection through connect_pg_net is disabled.
Loading library and design information.
Updating PG strategies.
Updating strategy S_default_vddvss.
Number of Standard Cells: 0
Number of Hard Macros: 0
Number of Pads: 0
Creating straps and vias in power plan.
Creating wire shapes for strategies S_default_vddvss .
Creating wire shapes runtime: 0 seconds
Blockage cutting and DRC fixing for wire shapes for strategies S_default_vddvss .
Check and fix DRC for 18 wires for strategy S_default_vddvss.
Checking DRC for 18 wires:0% 10% 20% 30% 40% 50% 60% 70% 80% 90% 100%
Creating 18 wires after DRC fixing.
Wire DRC checking runtime 0.00 seconds.
Creating via shapes for strategies S_default_vddvss .
Working on strategy S_default_vddvss.
Number of detected intersections: 41
Total runtime of via shapes creation: 0 seconds
Check and fix DRC for 41 stacked vias for strategy S_default_vddvss.
Checking DRC for 41 stacked vias:0% 5% 10% 15% 20% 25% 30% 35% 40% 45% 50% 55% 60% 65% 70% 75% 80% 85% 90% 95% 100%
Runtime of via DRC checking for strategy S_default_vddvss: 0.00 seconds.
Creating via connection between strategies and existing shapes.
Via DRC checking runtime 0.00 seconds.
via connection runtime: 0 seconds.
Removing dangling/floating wire/vias after DRC check.
Start iteration 1:
Checking potential dangling/floating power plan wires.
Checking dangling/floating vias inside strategy S_default_vddvss.
Checking 41 stacked vias:0% 10% 20% 30% 40% 50% 60% 70% 80% 90% 100%
Finish removing all dangling or floating wires and vias.
Commiting wires and vias.
Committed 54 wires.
Created 36 pins at design boundary.
Committing wires takes 0.00 seconds.
Committed 41 vias.
Committed 0 wires for via creation.
Committing vias takes 0.00 seconds.
Overall PG creation runtime: 0 seconds.
Successfully compiled PG.
Overall runtime: 0 seconds.
1
icc2_shell> 
Begin building search trees for block lib:29th_MAY_FLOORPLAN.design
Done building search trees for block lib:29th_MAY_FLOORPLAN.design (time 0s)
icc2_shell> create_pg_std_cell_conn_pattern std_rail_conn1 -rail_width 0.094 -layers M1
Successfully create standard cell rail pattern std_rail_conn1.
icc2_shell> set_pg_strategy  std_rail_1 -pattern {{name : std_rail_conn1} {nets: "VDD VSS"}} -core
Successfully set PG strategy std_rail_1.
icc2_shell> compile_pg -strategies std_rail_1
Sanity check for inputs.
No strategy-level via rule is specified, the default rule will be applied.
Automatic PG net connection through connect_pg_net is disabled.
Loading library and design information.
Updating PG strategies.
Updating strategy std_rail_1.
Number of Standard Cells: 0
Number of Hard Macros: 0
Number of Pads: 0
Creating standard cell rails.
Creating standard cell rails for strategy std_rail_1.
DRC checking and fixing for standard cell rail strategy std_rail_1.
Checking DRC for 38 wires:0% 10% 20% 30% 40% 50% 60% 70% 80% 90% 100%
Creating 38 wires after DRC fixing.
Wire DRC checking runtime 0.00 seconds.
Creating via connection between strategies and existing shapes.
Check and fix DRCs for 171 stacked vias.
Checking DRC for 171 stacked vias:0% 5% 10% 15% 20% 25% 30% 35% 40% 45% 50% 55% 60% 65% 70% 75% 80% 85% 90% 95% 100%
Via DRC checking runtime 0.00 seconds.
via connection runtime: 0 seconds.
Removing dangling/floating wire/vias after DRC check.
Start iteration 1:
Checking potential dangling/floating power plan wires.
Checking dangling/floating vias between strategies and existing shapes.
Checking 171 stacked vias:0% 10% 20% 30% 40% 50% 60% 70% 80% 90% 100%
Finish removing all dangling or floating wires and vias.
Commiting wires and vias.
Committed 38 wires.
Committing wires takes 0.00 seconds.
Committed 1197 vias.
Committed 1026 wires for via creation.
Committing vias takes 0.00 seconds.
Overall PG creation runtime: 0 seconds.
Successfully compiled PG.
Overall runtime: 0 seconds.
1
icc2_shell> 
Begin building search trees for block lib:29th_MAY_FLOORPLAN.design
Done building search trees for block lib:29th_MAY_FLOORPLAN.design (time 0s)
icc2_shell> check_pg_connectivity
Loading cell instances...
Number of Standard Cells: 753
Number of Macro Cells: 0
Number of IO Pad Cells: 0
Number of Blocks: 0
Loading P/G wires and vias...
Number of VDD Wires: 483
Number of VDD Vias: 548
Number of VDD Terminals: 16
Number of VSS Wires: 599
Number of VSS Vias: 690
Number of VSS Terminals: 20
**************Verify net VDD connectivity*****************
  Number of floating wires: 0
  Number of floating vias: 0
  Number of floating std cells: 532
  Number of floating hard macros: 0
  Number of floating I/O pads: 0
  Number of floating terminals: 0
  Number of floating hierarchical blocks: 0
************************************************************
**************Verify net VSS connectivity*****************
  Number of floating wires: 0
  Number of floating vias: 0
  Number of floating std cells: 532
  Number of floating hard macros: 0
  Number of floating I/O pads: 0
  Number of floating terminals: 0
  Number of floating hierarchical blocks: 0
************************************************************
Overall runtime: 0 seconds.
icc2_shell> check_pg_drc
Command check_pg_drc started  at Sun May 29 20:59:39 2022
Command check_pg_drc finished at Sun May 29 20:59:39 2022
CPU usage for check_pg_drc: 0.02 seconds ( 0.00 hours)
Elapsed time for check_pg_drc: 0.02 seconds ( 0.00 hours)
No errors found.
icc2_shell> save_block -as 29th_MAY_POWERPLAN_DONE
Information: Saving 'lib:29th_MAY_FLOORPLAN.design' to 'lib:29th_MAY_POWERPLAN_DONE.design'. (DES-028)
1
icc2_shell> close_block -f
Closing block 'lib:29th_MAY_FLOORPLAN.design'
1
icc2_shell> close_lib
Closing library 'lib'
1
icc2_shell> exit
Maximum memory usage for this session: 410.45 MB
CPU usage for this session:     23 seconds (  0.01 hours)
Elapsed time for this session:    299 seconds (  0.08 hours)
Thank you for using IC Compiler II.

